app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "орири"], ["commenter", "отол"], ["created_at", Fri, 28 Feb 2014 06:54:15 UTC +00:00], ["post_id", 1], ["updated_at", Fri, 28 Feb 2014 06:54:15 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)