app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 24 Feb 2014 10:05:22 UTC +00:00], ["text", "йцуке"], ["title", "12345"], ["updated_at", Mon, 24 Feb 2014 10:05:22 UTC +00:00]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "как жить?"], ["text", "Жить тра та та та татататататататататтатататтатататтатататата"], ["updated_at", Wed, 05 Mar 2014 14:16:23 UTC +00:00]]